app/services/ClassServices.php

    public function getClass()
    {
        return $this->class->findAll();
---
SELECT *
FROM `class`