app/services/LoginService.php

SELECT *
FROM `users`
WHERE `user_id` = 'admin01'
 LIMIT 1
---
    public function hasLoginInfo($requestData)
    {
        // dd($requestData->getPost());
        $validate = $this->validateLogin($requestData);
        if ($validate->getErrors()) {
            return [
                'status' => Result::STATUS_CODE_ERR,
                'messageCode' => Result::MESSAGE_CODE_ERR,
                'messages' => $validate->getErrors()
            ];
        }
        $param = $requestData->getPost();

        $user = $this->users->where('user_id', $param['user_id'])->first();

SELECT `type`
FROM `users`
WHERE `user_id` = 'admin01'
---
            $user['loai'] = 1;
            $user['code'] = $teacher['magiaovien'];
        }else{
            $admin= $this->users->select('type')->where('user_id',$param['user_id'])->get()->getRowArray();