app/services/StudentService.php

    public function getAllStudent()
    {
        return $this->students->table('student')
        ->select('student.id,student.masinhvien, student.name, class.nameClass, student.phone, student.ngaysinh, student.gioitinh, student.dantoc, student.diachi, student.quequan')
        ->join('student_class', 'student.id = student_class.student_id')
        ->join('class', 'student_class.class_id = class.id')->get()->getResultArray();
---
SELECT `student`.`id`, `student`.`masinhvien`, `student`.`name`, `class`.`nameClass`, `student`.`phone`, `student`.`ngaysinh`, `student`.`gioitinh`, `student`.`dantoc`, `student`.`diachi`, `student`.`quequan`
FROM `student`
JOIN `student_class` ON `student`.`id` = `student_class`.`student_id`
JOIN `class` ON `student_class`.`class_id` = `class`.`id`

    public function updateStudent($id, $field, $value)
    {
        // Sử dụng biến trung gian để tạo mảng kết hợp
        $data = [
            $field => $value
        ];

        // Cập nhật mảng kết hợp
        return $this->students->update($id, $data);
---
UPDATE `student` SET `quequan` = 'Hà Nội1'
WHERE `student`.`id` IN ('4')

    public function deleteStudent($id){
        $deleted = $this->students->table('student')->delete(['id' => $id]);
---
DELETE FROM `student`
WHERE `id` IN ('28')