app/services/SubjectService.php

SELECT *
FROM `subject`
---
    public function getAllSubject()
    {
        return $this->subject->findAll();