app/services/TeacherService.php

SELECT *
FROM `teacher`
---
    public function getAllTeachers()
    {
        return $this->teachers->findAll();